print("Бондар Ілля Юрійович \nЛабораторна робота №1 \nВаріант 1 \nУвести з клавіатури три дійсних числа ")
print("KM - 93")

a = float(input("Перше число = "))
b = float(input("Друге число = "))
c = float(input("Третє число = "))

if a >= 0:
	print("Результат для першого число : " + str(round(a**2,3)))

elif a < 0:
	print("Результат для першого число : " + str(round(a**4,3)))

if b >= 0:
	print("Результат для другого число : " + str(round(b**2,3)))

elif b < 0:
	print("Результат для другого число : " + str(round(b**4,3)))

if c >= 0:
	print("Результат для третього число : " + str(round(c**2,3)))

elif c < 0:
	print("Результат для третього число : " + str(round(c**4,3)))
print("Робота програми завершена")